InformationRegisters/ЦеныНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ЦеныНоменклатуры</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВидЦены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ХозяйственныеОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ХозяйственныеОперации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаВСтранахЕАЭС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаЧерезПодотчетноеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаУПоставщикаРеглУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ЗакупкаПоИмпорту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпособыДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>СпособыДоставки</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПоставщикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>НашимиСиламиСАдресаОтправителя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоПунктаПередачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СиламиПеревозчикаДоНашегоСклада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ОтОтправителяОпределяетСлужбаДоставки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/РеализацияТоваровУслуг.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>РеализацияТоваровУслуг</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КГМ_Прослеживаемость</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>алкСуммаАкцизаНачисленного</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПеремещениеТоваров</Name>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.КГМ_Прослеживаемость</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладОтправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СкладПолучатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>Серия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СерииНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<ObjectBelonging>Adopted</ObjectBelonging>
							<Name>алкСуммаАкцизаНачисленного</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

CommonModules/MRS_ПартионныйУчетЛокализация/Ext/Module.bsl
&НаСервере
Процедура СозданиеВГОПоЗаказамНаПеремещение(Объект, Отказ, РежимПроведения) Экспорт
	
	// Если у проводимого документа ПеремещениеТоваров заполнены реквизиты Объект.ДокументОснование и Объект.ЗаказНаПеремещение
	// И при этом Объект.Организация отличается от Объект.ДокументОснование.Организация Тогда необходимо сформировать межфирменные документы 
	// для закрытия возникаемого отрицательного остатка
	// Сначала продажа, ранее документа перемещения, но не ранее документа закупки (ПТУ) в Объект.ДокументОснование
	// Потом поступление на Объект.Организация
	
	
	//Объект.Организация
	//Объект.ЗаказНаПеремещение - ДокументСсылка.ЗаказНаПеремещение
	//Объект.ЗаказНаПеремещение.Организация

	
	// Сначала проверяем связано ли уже это перемещение ЗапросСвязанныхДокументов()
	// Проверить что ревизиты  документов Приобретения и РЕализации не отличаются от Перемещения,
	// если отличаются тогда перезапишем доки РТУ и ПТУ иначе не нужно
	// если отмена проведения документа перемещения или установка пометки удаления документы ПТУ и РТУ должны повторять
	
	// Цены для новых документов ПТУ и РТУ нужно взять из Объект.ДокументОснование, Табличная часть Товары.Цена				
	
	// НоваяСтрока.СтавкаНДС = УчетНДСУПВызовСервера.СтавкаНДСПоУмолчанию(Организация,ТекущаяДата());
	
	//получаем реквизиты для заполнения документов
	//СтруктураДействий = ПолучитьСтруктуруДействийДляТабличнойЧасти(ДокОбъектРТУ);
	
КонецПроцедуры	 
				
				
//получение связанных документов
&НаСервере
Функция ЗапросСвязанныхДокументов(Ссылка)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СвязанныеДокументы.Ссылка.MRS_Перемещение КАК Перемещение,
	|	СвязанныеДокументы.Ссылка КАК Приобретение,
	|	СвязанныеДокументы.Ссылка.Проведен КАК ПриобретениеПроведен,
	|	СвязанныеДокументы.Ссылка.ПометкаУдаления КАК ПриобретениеПометкаУдаления,
	|	СвязанныеДокументы.Ссылка.MRS_Реализация КАК Реализация,
	|	СвязанныеДокументы.Ссылка.MRS_Реализация.Проведен КАК РеализацияПроведен,
	|	СвязанныеДокументы.Ссылка.MRS_Реализация.ПометкаУдаления КАК РеализацияПометкаУдаления
	|ИЗ
	|	КритерийОтбора.СвязанныеДокументы(&Ссылка) КАК СвязанныеДокументы
	|ГДЕ
	|	СвязанныеДокументы.Ссылка ССЫЛКА Документ.ПриобретениеТоваровУслуг"; 
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить().Выбрать();
	
	Возврат Результат;
	
КонецФункции

//Для обаботки ТЧ
&НаСервере
Функция ПолучитьСтруктуруДействийДляТабличнойЧасти(ЭтотОбъект)
	
	СтруктураПересчетаСуммы = Новый Структура("ЦенаВключаетНДС, НалогообложениеНДС", Истина, Перечисления.ТипыНалогообложенияНДС.ПродажаОблагаетсяНДС);
	
	СтруктураДействий = Новый Структура;
	СтруктураДействий.Вставить("ПересчитатьСуммуНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСуммуСНДС", СтруктураПересчетаСуммы);
	СтруктураДействий.Вставить("ПересчитатьСумму");
	
	Возврат СтруктураДействий;
	
КонецФункции

&НаСервере
Процедура ИнициализироватьДокументРТУ(ДокОбъектРТУ, СтруктураЗаполнения, СтрокаТЧ, ДатаДокументов)
	
	ДокОбъектРТУ.Дата = ДатаДокументов;
	ДокОбъектРТУ.Организация = СтруктураЗаполнения.ОрганизацияОтправитель;
	ДокОбъектРТУ.Склад = СтруктураЗаполнения.СкладОтправитель;
	ДокОбъектРТУ.Контрагент = СтруктураЗаполнения.КонтрагентРТУ;
	ДокОбъектРТУ.Партнер = СтруктураЗаполнения.ПартнерРТУ;
	ДокОбъектРТУ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.РеализацияКлиенту;
	ДокОбъектРТУ.СпособДоставки = Перечисления.СпособыДоставки.Самовывоз;
	ДокОбъектРТУ.Комментарий = "#Создано на основании перемещения из-за разницы Организации в Приобретении " + СтрокаТЧ.Номер + " " + СтрокаТЧ.Дата;
	ДокОбъектРТУ.MRS_Перемещение = СтрокаТЧ.Ссылка;
	
	
	ТаблицаДоговоров = СтруктураЗаполнения.ТаблицаДоговоров;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", СтруктураЗаполнения.ОрганизацияОтправитель);
	Отбор.Вставить("Контрагент", СтруктураЗаполнения.КонтрагентРТУ);
	Отбор.Вставить("ТипДоговора", ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем")); 
	МассивДоговоров = ТаблицаДоговоров.НайтиСтроки(Отбор);
	Если МассивДоговоров = Неопределено ИЛИ МассивДоговоров.Количество() = 0 Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не смогли получить договор при создании документа РТУ по Организации " + СтруктураЗаполнения.ОрганизацияОтправитель + " и Контрагенту " + СтруктураЗаполнения.КонтрагентРТУ + " тип договора " + 
		ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем"));
		ВызватьИсключение "Операция создания документов прервана!";
	Иначе
		Договор = МассивДоговоров[0].Договор;
		ДокОбъектРТУ.Договор = Договор;
	КонецЕсли;
	
	ДокОбъектРТУ.Автор = Пользователи.ТекущийПользователь();
	ДокОбъектРТУ.ЦенаВключаетНДС = Ложь; 
	ДокОбъектРТУ.Подразделение = СтрокаТЧ.ПодразделениеОтправитель;
	ДокОбъектРТУ.Менеджер = Пользователи.ТекущийПользователь();
	
	ДокОбъектРТУ.ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияКассыПриФОИспользоватьНесколькоКассЛожь", Ложь);
	ДокОбъектРТУ.ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	
	ЕстьКорректировки = Ложь;
	
	//Параметры печати
	ОтветственныеЛица = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(СтруктураЗаполнения.ОрганизацияОтправитель,ТекущаяДата());
	ДокОбъектРТУ.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтерСсылка;
	ДокОбъектРТУ.Руководитель = ОтветственныеЛица.РуководительСсылка;
	//в перемещении это спр.пользователи. В физлицах может не быть 
	ОтпустилФЛ = Справочники.ФизическиеЛица.НайтиПоНаименованию(СтрокаТЧ.Автор);
	ДокОбъектРТУ.Отпустил = ОтпустилФЛ;
	
	СтруктураПараметровБанковскогоСчета = Новый Структура;
	СтруктураПараметровБанковскогоСчета = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметровБанковскогоСчета.Организация = СтруктураЗаполнения.ОрганизацияОтправитель;
	ДокОбъектРТУ.БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметровБанковскогоСчета); 
	ДокОбъектРТУ.БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(СтруктураЗаполнения.КонтрагентРТУ, , ДокОбъектРТУ.БанковскийСчетКонтрагента);
	
	Если Не ЗначениеЗаполнено(ДокОбъектРТУ.Валюта) Тогда
		
		ДокОбъектРТУ.Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(Объект.Организация);
		
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.РеализацияТоваровУслуг.ПараметрыЗаполненияНалогообложенияНДСПродажи(ДокОбъектРТУ);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСПродажи(ДокОбъектРТУ.НалогообложениеНДС, ПараметрыЗаполнения);
	РеализацияТоваровУслугЛокализация.ОбработкаЗаполнения(ДокОбъектРТУ, СтрокаТЧ.Ссылка, Ложь);
	ВзаиморасчетыСервер.ОбработкаЗаполнения(ДокОбъектРТУ, СтрокаТЧ.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьДокументПТУ(СтрокаТЧ, СтруктураЗаполнения, ДокОбъектПТУ, ДокОбъектРТУ, ДокОбъектСФ, ДатаДокументов)
	
	ДокОбъектПТУ.Дата = ДатаДокументов + 1;
	ДокОбъектПТУ.Организация = СтруктураЗаполнения.ОрганизацияПолучатель;
	ДокОбъектПТУ.Подразделение = СтрокаТЧ.ПодразделениеПолучатель;
	ДокОбъектПТУ.Склад = СтруктураЗаполнения.СкладПолучатель;
	ДокОбъектПТУ.Контрагент = СтруктураЗаполнения.КонтрагентПТУ;
	ДокОбъектПТУ.Партнер = СтруктураЗаполнения.ПартнерПТУ;
	
	ТаблицаДоговоров = СтруктураЗаполнения.ТаблицаДоговоров;
	Отбор = Новый Структура;
	Отбор.Вставить("Организация", СтруктураЗаполнения.ОрганизацияПолучатель);
	Отбор.Вставить("Контрагент", СтруктураЗаполнения.КонтрагентПТУ);
	Отбор.Вставить("ТипДоговора", ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком"));
	
	МассивДоговоров = ТаблицаДоговоров.НайтиСтроки(Отбор);
	Если МассивДоговоров = Неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не смогли получить договор при создании документа РТУ по Организации " + СтруктураЗаполнения.ОрганизацияПолучатель + " и Контрагенту " + СтруктураЗаполнения.КонтрагентПТУ + " тип договора " + 
		ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПоставщиком"));
		ВызватьИсключение "Операция создания документов прервана!";
	Иначе
		Договор = МассивДоговоров[0].Договор;
		ДокОбъектПТУ.Договор = Договор;
	КонецЕсли;
	
	ДокОбъектПТУ.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ЗакупкаУПоставщика;
	ДокОбъектПТУ.СпособДоставки = Перечисления.СпособыДоставки.СиламиПоставщикаДоНашегоСклада;
	ДокОбъектПТУ.ВариантПриемкиТоваров = Перечисления.ВариантыПриемкиТоваров.РазделенаТолькоПоНакладным;
	ДокОбъектПТУ.НомерВходящегоДокумента = ДокОбъектСФ.Номер;
	ДокОбъектПТУ.ДатаВходящегоДокумента = ДокОбъектСФ.Дата;
	ДокОбъектПТУ.Комментарий = "#Создано на основании перемещения из-за разницы Организации в Приобретении" + СтрокаТЧ.Номер + " " + СтрокаТЧ.Дата;
	ДокОбъектПТУ.MRS_Перемещение = СтрокаТЧ.Ссылка;
	ДокОбъектПТУ.MRS_Реализация = ДокОбъектРТУ.Ссылка;
	ДокОбъектПТУ.Автор = Пользователи.ТекущийПользователь();
	ДокОбъектПТУ.Менеджер                  = Пользователи.ТекущийПользователь();
	ДокОбъектПТУ.ЦенаВключаетНДС = Ложь; 
	
	Если НЕ ЗначениеЗаполнено(ДокОбъектПТУ.Валюта) Тогда
		ДокОбъектПТУ.Валюта = ЗначениеНастроекПовтИсп.ВалютаРегламентированногоУчетаОрганизации(ДокОбъектПТУ.Организация);
	КонецЕсли;
	
	СтруктураПараметров = ДенежныеСредстваСервер.ПараметрыЗаполненияБанковскогоСчетаОрганизацииПоУмолчанию();
	СтруктураПараметров.Организация    		= ДокОбъектПТУ.Организация;
	СтруктураПараметров.БанковскийСчет		= ДокОбъектПТУ.БанковскийСчетОрганизации;
	ДокОбъектПТУ.БанковскийСчетОрганизации = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетОрганизацииПоУмолчанию(СтруктураПараметров);
	
	ДокОбъектПТУ.БанковскийСчетКонтрагента = ЗначениеНастроекПовтИсп.ПолучитьБанковскийСчетКонтрагентаПоУмолчанию(ДокОбъектПТУ.Контрагент, , ДокОбъектПТУ.БанковскийСчетКонтрагента);
	
	СтруктураОтветственного = ЗакупкиСервер.ПолучитьОтветственногоПоСкладу(ДокОбъектПТУ.Склад, ДокОбъектПТУ.Менеджер);
	
	Если СтруктураОтветственного <> Неопределено Тогда
		
		ДокОбъектПТУ.Принял = СтруктураОтветственного.Ответственный;
		ДокОбъектПТУ.ПринялДолжность = СтруктураОтветственного.ОтветственныйДолжность;
		
	КонецЕсли;
	
	ПараметрыЗаполнения = Документы.ПриобретениеТоваровУслуг.ПараметрыЗаполненияНалогообложенияНДСЗакупки(ДокОбъектПТУ);
	УчетНДСУП.ЗаполнитьНалогообложениеНДСЗакупки(ДокОбъектПТУ.НалогообложениеНДС, ПараметрыЗаполнения);
	
	ПараметрыЗаполнения = Документы.ПриобретениеТоваровУслуг.ПараметрыЗаполненияВидаДеятельностиНДС(ДокОбъектПТУ);
	УчетНДСУП.ЗаполнитьВидДеятельностиНДС(ДокОбъектПТУ.ЗакупкаПодДеятельность, ПараметрыЗаполнения);
	
	СтруктураПересчетаСуммы = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыПересчетаСуммыНДСВТЧ(ДокОбъектПТУ);
	СтруктураЗаполненияСтавкиНДС = ОбработкаТабличнойЧастиКлиентСервер.ПараметрыЗаполненияСтавкиНДС(ДокОбъектПТУ);
	СтруктураЗаполненияСтавкиНДС.ИнициализацияВходящегоДокумента = Истина;
	КэшированныеЗначения = ОбработкаТабличнойЧастиКлиентСервер.ПолучитьСтруктуруКэшируемыеЗначения();
	
	ДокОбъектПТУ.ДополнительныеСвойства.Вставить("НеобходимостьЗаполненияСчетаПриФОИспользоватьНесколькоСчетовЛожь", Ложь);
	
	ПараметрыВыбораСтатейИАналитик = Документы.ПриобретениеТоваровУслуг.ПараметрыВыбораСтатейИАналитик(ДокОбъектПТУ.ХозяйственнаяОперация);
	ДоходыИРасходыСервер.ОбработкаЗаполнения(ДокОбъектПТУ, ПараметрыВыбораСтатейИАналитик);
	
	ПриобретениеТоваровУслугЛокализация.ОбработкаЗаполнения(ДокОбъектПТУ, СтрокаТЧ.Ссылка, Ложь);
	
	ВзаиморасчетыСервер.ОбработкаЗаполнения(ДокОбъектПТУ, СтрокаТЧ.Ссылка);
	
	СкладГруппа = Справочники.Склады.ЭтоГруппаИСкладыИспользуютсяВТЧДокументовЗакупки(ДокОбъектПТУ.Склад);
	СкладыСервер.ЗаполнитьСкладыВТабличнойЧасти(ДокОбъектПТУ.Склад, СкладГруппа, ДокОбъектПТУ.Товары, Ложь);
	
	//Данные печати
	ОтветственныеЛица = ОтветственныеЛицаСервер.ПолучитьОтветственныеЛицаОрганизации(СтруктураЗаполнения.ОрганизацияПолучатель,ТекущаяДата());
	ДокОбъектПТУ.ГлавныйБухгалтер = ОтветственныеЛица.ГлавныйБухгалтерСсылка;
	ДокОбъектПТУ.Руководитель = ОтветственныеЛица.РуководительСсылка;
	
КонецПроцедуры

//получение ТЧ товаров
&НаСервере
Функция ПолучитьТаблицуТоваровИзПермещения(Ссылка)
	
	СтруктураВозврата = Новый Структура;
	
	Текст = "ВЫБРАТЬ
	        |	ПеремещениеТоваров.СкладОтправитель КАК СкладОтправитель,
	        |	ПеремещениеТоваров.СкладПолучатель КАК СкладПолучатель,
	        |	ПеремещениеТоваров.СкладОтправитель.ПЛ_Организация КАК СкладОтправительПЛ_Организация,
	        |	ПеремещениеТоваров.СкладПолучатель.ПЛ_Организация КАК СкладПолучательПЛ_Организация,
	        |	ПеремещениеТоваров.Проведен КАК Проведен,
	        |	ПеремещениеТоваров.Ссылка КАК Ссылка,
	        |	ПеремещениеТоваров.СкладПолучатель.УчетныйВидЦены КАК УчетныйВидЦены
	        |ИЗ
	        |	Документ.ПеремещениеТоваров КАК ПеремещениеТоваров
	        |ГДЕ
	        |	ПеремещениеТоваров.Ссылка = &Ссылка
	        |	И НЕ ПеремещениеТоваров.ПометкаУдаления
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ПеремещениеТоваровТовары.Номенклатура КАК Номенклатура,
	        |	СУММА(ПеремещениеТоваровТовары.Количество) КАК Количество,
	        |	СУММА(ПеремещениеТоваровТовары.КоличествоУпаковок) КАК КоличествоУпаковок,
	        |	0 КАК Цена,
	        |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.УчетныйВидЦены КАК УчетныйВидЦены
	        |ПОМЕСТИТЬ ВТ_Номенклатура
	        |ИЗ
	        |	Документ.ПеремещениеТоваров.Товары КАК ПеремещениеТоваровТовары
	        |ГДЕ
	        |	ПеремещениеТоваровТовары.Ссылка = &Ссылка
	        |	И НЕ ПеремещениеТоваровТовары.Ссылка.ПометкаУдаления
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ПеремещениеТоваровТовары.Номенклатура,
	        |	ПеремещениеТоваровТовары.Ссылка.СкладПолучатель.УчетныйВидЦены
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВТ_Номенклатура.Номенклатура КАК Номенклатура,
	        |	ВТ_Номенклатура.Количество КАК Количество,
	        |	ВТ_Номенклатура.КоличествоУпаковок КАК КоличествоУпаковок,
	        |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена + ЦеныНоменклатурыСрезПоследних.Цена * 0.05, 0) КАК Цена
	        |ПОМЕСТИТЬ ВТ_Цена
	        |ИЗ
	        |	ВТ_Номенклатура КАК ВТ_Номенклатура
	        |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&ТекущаяДата, ) КАК ЦеныНоменклатурыСрезПоследних
	        |		ПО ВТ_Номенклатура.Номенклатура = ЦеныНоменклатурыСрезПоследних.Номенклатура
	        |			И ВТ_Номенклатура.УчетныйВидЦены = ЦеныНоменклатурыСрезПоследних.ВидЦены
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ВТ_Номенклатура.Номенклатура,
	        |	ВТ_Номенклатура.Количество,
	        |	ВТ_Номенклатура.КоличествоУпаковок,
	        |	ЕСТЬNULL(ЦеныНоменклатурыСрезПоследних.Цена + ЦеныНоменклатурыСрезПоследних.Цена * 0.05, 0)
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ВЫБОР
	        |		КОГДА ВТ_Цена.Цена <> 0
	        |			ТОГДА ВТ_Цена.Номенклатура
	        |		ИНАЧЕ ВТ_Номенклатура.Номенклатура
	        |	КОНЕЦ КАК Номенклатура,
	        |	ВТ_Номенклатура.Количество КАК Количество,
	        |	ВТ_Номенклатура.КоличествоУпаковок КАК КоличествоУпаковок,
	        |	ВЫБОР
	        |		КОГДА ВТ_Цена.Цена <> 0
	        |			ТОГДА ВТ_Цена.Цена
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК Цена
	        |ИЗ
	        |	ВТ_Номенклатура КАК ВТ_Номенклатура
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Цена КАК ВТ_Цена
	        |		ПО ВТ_Номенклатура.Номенклатура = ВТ_Цена.Номенклатура";

	Запрос = Новый Запрос(Текст);
	
	
	ТекущаяДата = КонецДня(ТекущаяДата());
	
	// Установка параметров.

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата);
	
	ПакетЗапросов = Запрос.ВыполнитьПакет();
	ВыборкаШапка = ПакетЗапросов[0].Выбрать();
	
	Пока ВыборкаШапка.Следующий() Цикл
		
		ОрганизацияПолучатель = ВыборкаШапка.СкладПолучательПЛ_Организация;
		ОрганизацияОтправитель = ВыборкаШапка.СкладОтправительПЛ_Организация;
		
		СтруктураВозврата.Вставить("СкладОтправитель", ВыборкаШапка.СкладОтправитель);
		СтруктураВозврата.Вставить("СкладПолучатель", ВыборкаШапка.СкладПолучатель);
		СтруктураВозврата.Вставить("ОрганизацияОтправитель", ОрганизацияОтправитель);
		СтруктураВозврата.Вставить("ОрганизацияПолучатель", ОрганизацияПолучатель);
		СтруктураВозврата.Вставить("Проведен", ВыборкаШапка.Проведен);
		СтруктураВозврата.Вставить("Ссылка", ВыборкаШапка.Ссылка);
		
	КонецЦикла;
	
	ЗначениеДопРеквизитаОрганизацияПолучатель = УправлениеСвойствами.ЗначениеСвойства(ОрганизацияПолучатель,"MRS_СоответсвиеОрганизацииКонтрагента");
	
	Если ЗначениеЗаполнено(ОрганизацияПолучатель) И НЕ ЗначениеЗаполнено(ЗначениеДопРеквизитаОрганизацияПолучатель) Тогда
		ТекстОшибки = НСтр("ru = 'Не настроено соответствие организации контрагента у '") + ОрганизацияПолучатель.Наименование;
		ДляАдминистратора = НСтр("ru = 'Не заполнен реквизит  MRS_СоответсвиеОрганизацииКонтрагента у :'") + " " + ОрганизацияПолучатель.Наименование;
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.НарушениеПравДоступа,, ДляАдминистратора);
	ИначеЕсли НЕ ЗначениеЗаполнено(ОрганизацияПолучатель) Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнено поле Организация получатель'");
		ДляАдминистратора = НСтр("ru = 'Не заполнено поле Организация получатель:'");
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.НарушениеПравДоступа,, ДляАдминистратора);
	КонецЕсли;
	
	ЗначениеДопРеквизитаОрганизацияОтправитель = УправлениеСвойствами.ЗначениеСвойства(ОрганизацияОтправитель,"MRS_СоответсвиеОрганизацииКонтрагента");
	
	Если ЗначениеЗаполнено(ОрганизацияОтправитель) И НЕ ЗначениеЗаполнено(ЗначениеДопРеквизитаОрганизацияОтправитель) Тогда
		ТекстОшибки = НСтр("ru = 'Не настроено соответствие организации контрагента у '") + ОрганизацияОтправитель.Наименование;
		ДляАдминистратора = НСтр("ru = 'Не заполнен реквизит  MRS_СоответсвиеОрганизацииКонтрагента у :'") + " " + ОрганизацияОтправитель.Наименование;
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.НарушениеПравДоступа,, ДляАдминистратора);
	ИначеЕсли НЕ ЗначениеЗаполнено(ОрганизацияОтправитель) Тогда
		ТекстОшибки = НСтр("ru = 'Не заполнено поле Организация Отправитель'");
		ДляАдминистратора = НСтр("ru = 'Не заполнено поле Организация Отправитель:'");
		ВызватьИсключение(ТекстОшибки, КатегорияОшибки.НарушениеПравДоступа,, ДляАдминистратора);
	КонецЕсли;
	
	СтруктураВозврата.Вставить("КонтрагентРТУ", ЗначениеДопРеквизитаОрганизацияПолучатель);
	СтруктураВозврата.Вставить("ПартнерРТУ", ЗначениеДопРеквизитаОрганизацияПолучатель.Партнер);
	
	СтруктураВозврата.Вставить("КонтрагентПТУ", ЗначениеДопРеквизитаОрганизацияОтправитель);
	СтруктураВозврата.Вставить("ПартнерПТУ", ЗначениеДопРеквизитаОрганизацияОтправитель.Партнер);
	
	СтруктураВозврата.Вставить("ТаблицаТоваров", ПакетЗапросов[3].Выгрузить());
	
	//(Дополнение структуры по разделению дороворов)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.Организация КАК Организация,
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.Контрагент КАК Контрагент,
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.ТипДоговора КАК ТипДоговора,
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.Договор КАК Договор
	|ИЗ
	|	РегистрСведений.MRS_СвязиДоговоровИОрганизаций.СрезПоследних КАК MRS_СвязиДоговоровИОрганизацийСрезПоследних
	|ГДЕ
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.Организация = &ОрганизацияОтправитель
	|	И MRS_СвязиДоговоровИОрганизацийСрезПоследних.Контрагент = &КонтрагентРТУ
	|	И MRS_СвязиДоговоровИОрганизацийСрезПоследних.ТипДоговора В (ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПокупателем))
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.Организация,
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.Контрагент,
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.ТипДоговора,
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.Договор
	|ИЗ
	|	РегистрСведений.MRS_СвязиДоговоровИОрганизаций.СрезПоследних КАК MRS_СвязиДоговоровИОрганизацийСрезПоследних
	|ГДЕ
	|	MRS_СвязиДоговоровИОрганизацийСрезПоследних.Организация = &ОрганизацияПолучатель
	|	И MRS_СвязиДоговоровИОрганизацийСрезПоследних.Контрагент = &КонтрагентПТУ
	|	И MRS_СвязиДоговоровИОрганизацийСрезПоследних.ТипДоговора В (ЗНАЧЕНИЕ(Перечисление.ТипыДоговоров.СПоставщиком))";
	
	Запрос.УстановитьПараметр("КонтрагентРТУ", СтруктураВозврата.КонтрагентРТУ);
	Запрос.УстановитьПараметр("ОрганизацияОтправитель", СтруктураВозврата.ОрганизацияОтправитель);
	Запрос.УстановитьПараметр("КонтрагентПТУ", СтруктураВозврата.КонтрагентПТУ);
	Запрос.УстановитьПараметр("ОрганизацияПолучатель", СтруктураВозврата.ОрганизацияПолучатель);
	
	ТаблицаДоговоров = Запрос.Выполнить().Выгрузить();
	СтруктураВозврата.Вставить("ТаблицаДоговоров", ТаблицаДоговоров);
	
	ИсхТабТоваров = СтруктураВозврата.ТаблицаТоваров;
	
		
	Возврат СтруктураВозврата;
	
КонецФункции
